Identifies if the view has ever been locked.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool HasBeenLocked()
  Visual Basic
Public Function HasBeenLocked As Boolean
  Visual C++
public:
bool HasBeenLocked()
 See Also
  View3D Class
  Autodesk.Revit.DB Namespace